## [ DataFrame 행/열 추가 ]

(1) 모듈 로딩 --------------------------------------------------

In [2]:
import pandas as pd

(2) 데이터 준비 ----------------------------------

In [3]:
# dict 타입의 데이터 생성
exam = { '이름' : ['김재중', '김현아', '조현아', '이창민'],
         '국어' : [78, 89 , 99, 29],
         '수학' : [98, 49 , 89, 99],
         '영어' : [98, 89 , 39, 49],
         '과학' : [18, 69 , 79, 89] }

(3) DataFrame에 데이터 저장

In [4]:
examDF = pd.DataFrame(exam)

In [5]:
print(examDF)

    이름  국어  수학  영어  과학
0  김재중  78  98  98  18
1  김현아  89  49  89  69
2  조현아  99  89  39  79
3  이창민  29  99  49  89

(4) 저장된 데이터 속성 확인 <hr>

In [16]:
print(f'index\n\t===> {examDF.index}')
print(f'columns\n\t===> {examDF.columns}')
print(f'shape\n\t===> {examDF.shape}')
print(f'ndim\n\t===> {examDF.ndim}')
print(f'dtypes\n\t===> {examDF.dtypes}')

index
	===> RangeIndex(start=0, stop=4, step=1)
columns
	===> Index(['이름', '국어', '수학', '영어', '과학'], dtype='object')
shape
	===> (4, 5)
ndim
	===> 2
dtypes
	===> 이름    object
국어     int64
수학     int64
영어     int64
과학     int64
dtype: object

In [29]:
def printAttribute(df,dfname):
    print(f'[{dfname}]')
    print(f'index]\t===>\t {df.index}')
    print(f'columns\t===>\t {df.columns}')
    print(f'shape\t===>\t {df.shape}')
    print(f'ndim\t===>\t {df.ndim}')
    print(f'\ndtypes\n\n{df.dtypes}')

In [30]:
printAttribute(examDF, 'examDF')

[examDF]
index]	===>	 RangeIndex(start=0, stop=4, step=1)
columns	===>	 Index(['이름', '국어', '수학', '영어', '과학'], dtype='object')
shape	===>	 (4, 5)
ndim	===>	 2

dtypes

이름    object
국어     int64
수학     int64
영어     int64
과학     int64
dtype: object

(5) DataFrame에 컬럼(column) 추가 <hr>
- 방법 : DF객체 변수명[새로운 컬럼명]=값

In [44]:
examDF.columns

Index(['이름', '국어', '수학', '영어', '과학', '사회'], dtype='object')

In [48]:
# 4개의 데이터 듯 값을 추가 시 모든 행에 해당 값으로 지정
examDF['체육']=[10,20,30,40]
examDF

    이름  국어  수학  영어  과학  사회  체육
0  김재중  78  98  98  18  10  10
1  김현아  89  49  89  69  10  20
2  조현아  99  89  39  79  10  30
3  이창민  29  99  49  89  10  40

In [58]:
# 1개의 데이터 즉 값 추가 시 모든 행에 동일 값으로 지정
examDF['사회']=10           # 10이라는 값을 모두 부여
# examDF['사회']=[10]       # 10이라는 값을 하나 부여
examDF['기술']=0                # 6번과목에 0이라는 값을 모두 부여

In [59]:
examDF

    이름  국어  수학  영어  과학  사회  체육  기술
0  김재중  78  98  98  18  10  10   0
1  김현아  89  49  89  69  10  20   0
2  조현아  99  89  39  79  10  30   0
3  이창민  29  99  49  89  10  40   0

In [60]:
# 여러개의 데이터가 행의 수와 맞지 않는 경우는 진행되지 않음
# examDF['컴퓨터']=[89,10]

In [61]:
examDF.columns

Index(['이름', '국어', '수학', '영어', '과학', '사회', '체육', '기술'], dtype='object')

(6) DataFrame에 행(row)추가 <hr>
- 방법 : DF객체변수명.loc[새로운 행인덱스] = [컬럼 수 만큼의 데이터]
- 방법 : DF객체변수명.loc[새로운 행인덱스] = 데이터
- 불가 방법 : DF객체변수명.iloc[새로운 행인덱스] = 데이터  => 데이터가 존재해야 인덱스가 할당됨

In [62]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [63]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[4] = ['김준수', 10, 20, 30, 40, 50, 60, 70]
examDF

    이름  국어  수학  영어  과학  사회  체육  기술
0  김재중  78  98  98  18  10  10   0
1  김현아  89  49  89  69  10  20   0
2  조현아  99  89  39  79  10  30   0
3  이창민  29  99  49  89  10  40   0
4  김준수  10  20  30  40  50  60  70

In [65]:
# 행 추가 시 iloc는 사용불가 
# => Why? 데이터 수에 맞게 인덱스 범위 지정이 되기 때문에 현재 인덱스에 없는 인덱스로는 불가

# examDF.iloc[5] = ['임윤아', 10, 20, 30, 40, 50, 60, 70]
examDF

    이름  국어  수학  영어  과학  사회  체육  기술
0  김재중  78  98  98  18  10  10   0
1  김현아  89  49  89  69  10  20   0
2  조현아  99  89  39  79  10  30   0
3  이창민  29  99  49  89  10  40   0
4  김준수  10  20  30  40  50  60  70

In [67]:
# 1개 데이터 가진 행 추가
examDF.loc[5] = '임윤아'
examDF                     # 임윤아가 임윤아 했다..

    이름   국어   수학   영어   과학   사회   체육   기술
0  김재중   78   98   98   18   10   10    0
1  김현아   89   49   89   69   10   20    0
2  조현아   99   89   39   79   10   30    0
3  이창민   29   99   49   89   10   40    0
4  김준수   10   20   30   40   50   60   70
5  임윤아  임윤아  임윤아  임윤아  임윤아  임윤아  임윤아  임윤아